package by.it.meshchenko.jd03_02;

public class jd03_02 {
    public static void main(String[] args) {
        // А.
        //  Для таблицы с ролями пользователей Вашего курсового проекта реализуйте поиск
        // ID роли по имени.
        //  Для таблицы с пользователямиВашего курсового проекта реализуйте набор
        // CRUD-операций (Create-Read-Update-Delete).
        //  Разместите наборы операций CRUD в одноименном пакете
        // by.it.ваша_фамилия.jd03_02.crud
        //  Разработайте программу которая выполняет для таблицы набор из CRUD-операций.
        //      Для корректной проверки используйте следующий порядок:
        //      Create+ Read (вывод наконсоль созданной записи).
        //      Update+ Read (вывод наконсоль обновленной записи).
        //      Delete + сообщение

        // B.
        //  Разработайте программу, которая выводит всех пользователей с их текстовыми
        // ролямина консоль.
        //  В конце должна быть итоговая строка с общим числом пользователей и числом
        // возможных ролей.

        // C.
        //  Разработайте (либо доработайте) методы сброса базы с операциями:
        //      Удаления всех таблиц в вашей базе данных (используйте SQL DROP TABLE IF
        //          EXISTS имя_таблицы)
        //      Создания всех таблиц (используйте как пример SQL из файла экспорта)
        //      Заполнения таблиц через CRUD операции, данные для заполнения можно:
        //          -парсить из XML-файла объекты (beans) и отправлять их в базу (фантастика)
        //          –прописать заполнение напрямую вызовом конструкторов объектов (beans)
        //              с нужными параметрами
        //          –свой вариант, но на базе объектов (beans)
        //      Сделайте тестовое покрытие jUnit для CRUD


    }
}
